==================
Empty value
==================
{}
---

(format_string
  (text)
  (maybe_format
    (format))
  (text))

==================
Variable with name
==================
{hello}
---

(format_string
  (text)
  (maybe_format
    (format
      (argument
        (identifier))))
  (text))

==================
Two variables
==================
{hello} {world}
---

(format_string
  (text)
  (maybe_format
    (format
      (argument
        (identifier))))
  (text)
  (maybe_format
    (format
      (argument
        (identifier))))
  (text))

==================
Two variables with text
==================
hello {hello} world {world}
---

(format_string
  (text)
  (maybe_format
    (format
      (argument
        (identifier))))
  (text)
  (maybe_format
    (format
      (argument
        (identifier))))
  (text))

==================
Padding and alignment
==================
{:>5} {:<5} {:^5}
---

(format_string
  (text)
  (maybe_format
    (format
      (align)
      (count
        (integer))))
  (text)
  (maybe_format
    (format
      (align)
      (count
        (integer))))
  (text)
  (maybe_format
    (format
      (align)
      (count
        (integer))))
  (text))

==================
Floating points
==================
{:10.2}
---

(format_string
  (text)
  (maybe_format
    (format
      (count
        (integer))
      (count
        (integer))))
  (text))

==================
Hexadecimal and binary formatting
==================
{:b} {:x} {:X}
---

(format_string
  (text)
  (maybe_format
    (format
      (type)))
  (text)
  (maybe_format
    (format
      (type)))
  (text)
  (maybe_format
    (format
      (type)))
  (text))

==================
Debug formatting
==================
hello {world:?} again
yet {world:#?} hello
{:?} hello {:#?} hello
---

(format_string
  (text)
  (maybe_format
    (format
      (argument
        (identifier))
      (type)))
  (text)
  (maybe_format
    (format
      (argument
        (identifier))
      (type)))
  (text)
  (maybe_format
    (format
      (type)))
  (text)
  (maybe_format
    (format
      (type)))
  (text))

==================
Padding, width and alignment
==================
{:0>5} padded with zeroes, right-aligned
{:0<5} padded with zeroes, left-aligned
{:0^5} padded with zeroes, centered
---

(format_string
  (text)
  (maybe_format
    (format
      (fill)
      (align)
      (count
        (integer))))
  (text)
  (maybe_format
    (format
      (fill)
      (align)
      (count
        (integer))))
  (text)
  (maybe_format
    (format
      (fill)
      (align)
      (count
        (integer))))
  (text))

==================
Formatting with Sign Handling
==================
{:+}
{:-}
{: }
---

(format_string
  (text)
  (maybe_format
    (format
      (sign)))
  (text)
  (maybe_format
    (format
      (sign)))
  (text)
  (maybe_format
    (format))
  (text))

==================
Scientific notation
==================
{:e}
{:E}
{:.*}
---

(format_string
  (text)
  (maybe_format
    (format
      (type)))
  (text)
  (maybe_format
    (format
      (type)))
  (text)
  (maybe_format
    (format))
  (text))

==================
multiple formatting options
==================
uhm {:<10} | pi: {:.2} | hex: {:x} | padded: {:0>8}
---

(format_string
  (text)
  (maybe_format
    (format
      (align)
      (count
        (integer))))
  (text)
  (maybe_format
    (format
      (count
        (integer))))
  (text)
  (maybe_format
    (format
      (type)))
  (text)
  (maybe_format
    (format
      (fill)
      (align)
      (count
        (integer))))
  (text))
